In [1]:
import pandas as pd

In [2]:
two_dimensional_list = [['dongwook', 50, 86], ['sineul', 89, 31], ['ikjoong', 68, 91]]

In [9]:
import numpy as np
a = np.array(two_dimensional_list)
a

array([['dongwook', '50', '86'],
       ['sineul', '89', '31'],
       ['ikjoong', '68', '91']], dtype='<U8')

In [6]:
my_df = pd.DataFrame(two_dimensional_list)

In [7]:
my_df

          0   1   2
0  dongwook  50  86
1    sineul  89  31
2   ikjoong  68  91

In [8]:
type(my_df)

pandas.core.frame.DataFrame

In [11]:
my_df2 = pd.DataFrame(two_dimensional_list, columns=['name', 'english_score', 'math_score'], index=['a', 'b', 'c'])
my_df2

       name  english_score  math_score
a  dongwook             50          86
b    sineul             89          31
c   ikjoong             68          91

In [12]:
my_df2.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

In [13]:
my_df2.index

Index(['a', 'b', 'c'], dtype='object')

In [14]:
my_df2.dtypes

name             object
english_score     int64
math_score        int64
dtype: object

In [15]:
#column= 열, 열은 한가지의 데이터 타입만 가질 수 있다.

In [19]:
#int64	정수
#float64	소수
#object	텍스트
#bool	불린(참과 거짓)
#datetime64	날짜와 시간
#category	카테고리